#include <iostream>
#include "vector"

using namespace std;

int main() {
    cout << "Buffet" << endl;
    int cutlery [2][6] = {{4,3,3,3,3,3},
                          {4,3,3,3,3,3}};

    int dishes [2][6] = {{3,2,2,2,2,2},
                         {3,2,2,2,2,2}};

    int chairs [2][6] = {{1,1,1,1,1,1},
                         {1,1,1,1,1,1}};

    chairs[0][4]+=1; // дама привела ребенка и ему дали дополнительный стул
    cutlery[1][2]-=1; // у кого-то украли ложку
    cutlery[0][0]-=1; // один из VIP-ов отдал ложку...
    cutlery[1][2]+=1; // ... тому у кого-то ложку украли
    dishes[0][0]-=1; // у добропорядочного VIP-а забрали лишнюю тарелку

    return 0;
}